{
  "blogs": [
    {
      "title": "Welcome to My Blog",
      "body": "The who, what, and why of Morgan Butler Blog…\nWelcome to my first blog post! Ahh I am so excited to be writing this right now, and even more excited knowing that YOU are finally reading it! I am Morgan Butler, owner and author of Morgan Butler Blog (obviously, lol). I have been wanting to start my own lifestyle blog for about four years now. It’s something I am so passionate about and have wanted to do for a long time, but more on that later. For my first blog post I wanted to let you know more about me and what you can expect to see here!\n\nLet me introduce myself… a little about me\nI was born and raised in the beautiful state of Idaho and have called it home all my life. I attended Utah State University my freshman year of college, then moved back home and attended Idaho State University studying Business Marketing. English was always my best subject in school- it was my favorite class and came really easily to me. I always enjoyed writing which is one of the reasons I wanted to start blogging! Throughout my life I have worked as a daycare teacher, restaurant hostess, makeup sales manager and artist, real estate assistant, and real estate agent. My hope and goal now is to turn my passion of blogging into my full-time business!\n\nIn June of 2018 I married my high school sweetheart, Logan, and in March 2020 we had our first baby boy, Beckam. We have a family YouTube channel called ‘The Butler Fam‘ where we post family vlogs and other fun videos. Our family is everything to us! We both have large families and love spending time with them. We also have two furry family members named Murphy and Walker- both Golden Retrievers and the best good boys. In our free time we love going camping, hiking, just being in the outdoors, or working on our home.\n\nWhat this blog is all about…\nFor my first blog post I want to give you an idea of what you will expect to see here! This space will be a little bit of everything – topics from babies and motherhood, tips and tricks in all things beauty, fashion and style ideas, and all things lifestyle including some home and organizational posts, product reviews and favorites, and just daily thoughts and things. My goal for this site is for all of my readers to find daily inspiration, useful advice, a new favorite product, and relatable and helpful content as a mama. I like to write my content like I’m talking with a best friend- always keeping it real and to the point.\n\nI would love to know more about you! Leave me a comment down below letting me know a bit about you and what you hope to see here. I can’t wait to connect with you all!\n\nWhy blogging?\nThe original Morgan Butler Blog started back in 2018 (anyone remember my OG site!?) That first space was a fun creative outlet for me to start, but I didn’t do much with it and definitely didn’t really know what I was doing. However, it has stayed in my mind since then and I always knew it was something I wanted to continue doing. There are so many reasons in my life that point to blogging. Like I said earlier, I love to write! Being able to share ideas and connect with new people through blogging is so fun and exciting to me. Blogging also allows me to pursue my hobby and passion of photography. I love being behind the camera as well as in front of the lens. I have shared so much of my life through Instagram and YouTube, and now with this site I have a place to combine it all. Also, it allows me to be home with my baby! I could go on and on about how passionate and excited I am for this, but I think you get the point!\n\nThank you for being here!\nLastly I just wanted to say thank you SO much for just being here and reading my first blog post. I am so grateful for my readers already and hope you continue to follow along! Please leave me any ideas or things you would like to see here! Also remember to join my e-mail newsletter to be notified of new posts. Thanks again, friends!",
      "author": "Kashif",
      "id": 1
    }
  ]
}